int main() {
 /* variable(s)
 [v1] min
 [v2] max
 [v3] out
 */
 seedr();
 int v1 = 1;
 int v2 = 28;
 int v3 = v1 + (rand() % static_cast<int>(v2 - v1 + 1));
 if (v3 == 1) cout << "مطلب خیر و صواب است. در آن اقدام کند." << endl;
 if (v3 == 2) cout << "آن مطلب از جهت او خیر است." << endl;
 if (v3 == 3) cout << "آن مطلب موجب نقصان معاصی و ناءل شدن به آرزو است." << endl;
 if (v3 == 4) cout << "آن مطلب موجب رزق و دولت و سعادت را دارا است." << endl;
 if (v3 == 5) cout << "آن مطلب باعث آن است که به شهوات و رزق ناءل گردد." << endl;
 if (v3 == 6) cout << "آن مطلب را ترک کند و اقدام به آن ننماید." << endl;
 if (v3 == 7) cout << "روزی حلال او را نصیب شود." << endl;
 if (v3 == 8) cout << "از خوف و بلیات ایمن گردد و بر دشمنان خود ظفر یابد." << endl;
 if (v3 == 9) cout << "پس او را مصاحبت با صاحب دولتی مرزوق گردد." << endl;
 if (v3 == 10) cout << "بر دشمنان خود قاهر گردد." << endl;
 if (v3 == 11) cout << "او را امارت و حکومتی بر ابناء جنس خود حاصل شود." << endl;
 if (v3 == 12) cout << "شروع در امری می کند که عاقبت آن خیر است." << endl;
 if (v3 == 13) cout << "او را سعادت روزی شود." << endl;
 if (v3 == 14) cout << "از اعداء خاءف باشد." << endl;
 if (v3 == 15) cout << "بر آن نیتی که نموده صبر کند." << endl;
 if (v3 == 16) cout << "در اقدام نمودنش به آن چه را که در نیت دارد به ندامت و پشیمانی واقع می شود." << endl;
 if (v3 == 17) cout << "به آنچه منوی اوست می رسد." << endl;
 if (v3 == 18) cout << "خداوند غنی و ثروت روزی او می گرداند." << endl;
 if (v3 == 19) cout << "برای او مخفیات امور منکشف می شود." << endl;
 if (v3 == 20) cout << "حذز نماید از منوی خود." << endl;
 if (v3 == 21) cout << "خداوند او را قبولی بین الناس کرامت فرماید." << endl;
 if (v3 == 22) cout << "در خصومت واقع می شود." << endl;
 if (v3 == 23) cout << "بر اعداء مسلط می گردد." << endl;
 if (v3 == 24) cout << "او را جاه و حشمت روزی می گردد." << endl;
 if (v3 == 25) cout << "آن چه را که در نظر دارد به او می رسد اما به تعب و زحمت." << endl;
 if (v3 == 26) cout << "ترسیده می شود به او از این که در مهالک واقع شود." << endl;
 if (v3 == 27) cout << "او از خلق به سوی حق فرار کند." << endl;
 if (v3 == 28) cout << "محتاج می شود به سوی معاون." << endl;
}
