/*START
هشت نخود
از حضرت دانیال (ع) روایت است که اگر خواهید بدانید حاجت تان برآورده می شود یا نه، ابتدا نیت کرده و یک قبضه نخود یا سایر حبوبات بگیرید و هشت هشت تعداد کنید..
STOP*/

int main() {
 seedr();
 int v1 = rand();
 if ((v1 % 8) == 0)
  cout << "زمین" << endl << "برای تو سودی ندارد. منتظر برآورده شدن آن حاجت مباش که در آن در توقف ماند." << endl;
 if ((v1 % 8) == 1)
  cout << "زهره" << endl << "حاجت اش چنان که نیت کرده همان قرار روا خواهد شد." << endl;
 if ((v1 % 8) == 2)
  cout << "مریخ" << endl << "آن حاجت برآورده نخواهد شد." << endl;
 if ((v1 % 8) == 3)
  cout << "ذنبه" << endl << "آن حاجت نحس است و برآورده نخواهد شد." << endl;
 if ((v1 % 8) == 4)
  cout << "زحل" << endl << "آن حاجت برآورده نخواهد شد." << endl;
 if ((v1 % 8) == 5)
  cout << "مشتری" << endl << "آن حاجت به زودی برآورده خواهد شد." << endl;
 if ((v1 % 8) == 6)
  cout << "قمر" << endl << "آن حاجت برآورده خواهد شد." << endl;
 if ((v1 % 8) == 7)
  cout << "عطارد" << endl << "آن حاجت به خوبی برآورده می شود." << endl;
}
